app/Controllers/ScheduleController.php

    public function index()
    {
        if (session()->get('num_user') == '') {
            return redirect()->to('/login');
            }
        // Fetch available movies, studios, and other required data
        $movieModel = new Movie();
        $studioModel = new StudioModel();
        $scheduleModel = new ScheduleModel();

        $data['movies'] = $movieModel->findAll();
        $data['studios'] = $studioModel->where('status', 1)->findAll();
        $data['schedules'] = $scheduleModel->findAll();
---
SELECT *
FROM `Movie`
SELECT *
FROM `studio`
WHERE `status` = 1
SELECT *
FROM `schedule`