app/Controllers/StudioController.php

    public function create()
    {
        $studioName = esc($this->request->getPost('studioName'));

        // Check if the studio name already exists
        $existingStudio = $this->studioModel->where('studioName', $studioName)->first();

        if ($existingStudio !== null) {
            return redirect()->to(base_url('studio'))->with('errorAddStudio', 'Studio with the same name already exists!');
        }

        $capacity = $this->request->getPost('capacity');

        // Validate the capacity value
        if (!is_numeric($capacity) || $capacity <= 0 || $capacity > 100) {
            return redirect()->to(base_url('studio'))->with('invalidCapacity', 'Invalid capacity. Please provide a value between 1 and 100!');
        }

        // Insert data into the studio table
        $data = [
            'studioName' => $studioName,
            'status' => esc($this->request->getPost('status')),
            'capacity' => $capacity,
            'generated_seats' => json_encode($this->generateSeats($capacity)) // Store the generated seats as JSON
        ];

        $this->studioModel->insert($data);
---
SELECT *
FROM `studio`
WHERE `studioName` = 'Studio 1'
 LIMIT 1
INSERT INTO `studio` (`studioName`, `status`, `capacity`, `generated_seats`) VALUES ('Studio 1', '1', '12', '[\"A1\",\"A2\",\"B1\",\"B2\",\"C1\",\"C2\",\"D1\",\"D2\",\"E1\",\"E2\",\"F1\",\"F2\"]')

    public function update($studioID = null)
    {
        // Get input data
        $capacity = $this->request->getPost('capacity');
        $availability = $this->request->getPost('availability');

        // Fetch the existing studio details
        $studio = $this->studioModel->findStudioByID($studioID);

        // Prepare update data
        $updateData = [];
        if (!empty($capacity)) {
            $updateData['capacity'] = $capacity;
            $updateData['generated_seats'] = json_encode($this->generateSeats($capacity));
        }
        if ($availability !== null && $availability !== $studio['status']) {
            $updateData['status'] = $availability;
        }

        // Perform update only if there's any data to update
        if (!empty($updateData)) {
            $this->studioModel->where('studioID', $studioID)->set($updateData)->update();
---
UPDATE `studio` SET `capacity` = '11', `generated_seats` = '[\"A1\",\"A2\",\"B1\",\"B2\",\"C1\",\"C2\",\"D1\",\"D2\",\"E1\",\"E2\",\"F1\"]', `status` = '0'
WHERE `studioID` = '23'