app/Models/Movie.php

    public function getDataMovie(){
        return $this->orderBy('movieID', 'DESC')->findAll(1000);
---
SELECT *
FROM `Movie`
ORDER BY `movieID` DESC
 LIMIT 1000