app/Models/ScheduleModel.php

SELECT `schedule`.`scheduleID`, `movie`.`title`, `studio`.`studioName`, `schedule`.`showtime`, `schedule`.`price`, `studio`.`capacity`
FROM `schedule`
JOIN `movie` ON `movie`.`movieID` = `schedule`.`movieID`
JOIN `studio` ON `studio`.`studioID` = `schedule`.`studioID`
---
    public function getScheduleDetails()
    {
        // Fetch schedule details along with related movie and studio information
        return $this->select('schedule.scheduleID, movie.title, studio.studioName, schedule.showtime, schedule.price, studio.capacity')
                    ->join('movie', 'movie.movieID = schedule.movieID')
                    ->join('studio', 'studio.studioID = schedule.studioID')
                    ->get()
                    ->getResultArray();