app/Models/StudioModel.php

    public function getDataStudio(){
        return $this->orderBy('studioID', 'ASC')->findAll(1000);
---
SELECT *
FROM `studio`
ORDER BY `studioID` ASC
 LIMIT 1000

    public function deleteStudio($studioID)
    {
        return $this->db->table('studio')->where('studioID', $studioID)->delete();
---
DELETE FROM `studio`
WHERE `studioID` = '23'

    public function findStudioByID($studioID) {
        return $this->db->table('studio')->where('studioID', $studioID)->get()->getRowArray();
---
SELECT *
FROM `studio`
WHERE `studioID` = '23'